content/emacs/configs/10-miscellaneous.org
#+TITLE: Miscellaneous
#+AUTHOR: Kyeong Soo Choi
#+STARTUP: overview
#+OPTIONS: toc:2 num:3
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :results none

* Introduction

Miscellaneous utilities and configurations including email, AI chat integration, PDF tools, and helper functions.

* Email Configuration

Configuration for reading and sending email using notmuch and msmtp.

** Notmuch

Fast email indexing and searching with notmuch.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;;; misc-conf.el --- Miscellaneous Configuration  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Miscellaneous utilities including email, AI chat, PDF tools, and helpers.
  ;;; Code:

  ;; Email - Notmuch
  (use-package notmuch
    :ensure t
    :defer t
    :config
    (setq mail-user-agent 'notmuch-user-agent))
#+end_src

** Email Sending

Configure email sending with msmtp and authentication.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;; Email - Sending Configuration
  (setq user-full-name (or (getenv "USER_FULL_NAME") user-full-name)
        user-mail-address (or (getenv "USER_EMAIL") user-mail-address)
        auth-sources '("~/.authinfo.gpg" "~/.authinfo"))

  ;; Use msmtp for sending mail
  (setq send-mail-function 'sendmail-send-it
        message-send-mail-function 'message-send-mail-with-sendmail
        sendmail-program (or (executable-find "msmtp") "/usr/bin/msmtp")
        message-sendmail-envelope-from 'header)
#+end_src

* GPTel - AI Chat Integration

Comprehensive AI chat integration with support for multiple providers (OpenAI, Claude, Gemini, etc.) with easy model switching and automatic chat history saving.

** Core Configuration

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;; GPTel - AI Chat Integration
  (use-package gptel
    :ensure t
    :custom
    ;; Default mode for chat buffers
    (gptel-default-mode 'org-mode)

    ;; Directory for saving chat history
    (gptel-chat-history-directory
     (expand-file-name "gptel-history" user-emacs-directory))

    ;; Model settings
    (gptel-model "claude-opus-4-5-20251101")
    (gptel-backend nil)  ; Will be set by backend setup

    ;; Streaming responses
    (gptel-stream t)

    ;; Display settings
    (gptel-use-curl t)
    (gptel-crowdsource-default-mode 'org-mode)

    :config
    ;; Ensure chat history directory exists
    (let ((history-dir (expand-file-name "gptel-history" user-emacs-directory)))
      (unless (file-directory-p history-dir)
        (make-directory history-dir t))))
#+end_src

** Backend Configuration

Set up multiple AI backends with API keys from environment variables or auth-sources.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;; GPTel Backend Configuration

  ;; Helper function to get API key
  (defun fu/gptel-get-api-key (service)
    "Get API key for SERVICE from environment or auth-sources.
  SERVICE should be something like 'OPENAI_API_KEY' or 'ANTHROPIC_API_KEY'."
    (or (getenv service)
        (plist-get (car (auth-source-search :host service)) :secret)))

  ;; Configure backends
  (with-eval-after-load 'gptel
    ;; Anthropic (Claude)
    (when-let ((key (fu/gptel-get-api-key "CLAUDE_API_KEY")))
      (setq gptel-anthropic-key key)
      (unless gptel-backend
        (setq gptel-backend
              (gptel-make-anthropic "Claude"
                :stream t
                :key key))))

    ;; OpenAI (GPT)
    (when-let ((key (fu/gptel-get-api-key "OPENAI_API_KEY")))
      (setq gptel-openai-key key)
      (gptel-make-openai "ChatGPT"
        :stream t
        :key key
        :models '("gpt-5.1-2025-11-13"
                  "gpt-5.1-codex"
                  "gpt-4.1"
                  "gpt-4.1-mini"
                  "gpt-4.1-nano"
                  "gpt-4o"
                  "gpt-4o-mini"
                  "gpt-4-turbo"
                  "gpt-3.5-turbo")))

    ;; Google (Gemini)
    (when-let ((key (fu/gptel-get-api-key "GEMINI_API_KEY")))
      (gptel-make-gemini "Gemini"
        :stream t
        :key key
        :models '("gemini-3-pro-preview"
                  "gemini-2.5-pro"
                  "gemini-2.5-flash"
                  "gemini-2.5-flash-lite-preview"
                  "gemini-2.0-flash-exp"
                  "gemini-1.5-pro"
                  "gemini-1.5-flash"))))
#+end_src

