emacs/configs/10-miscellaneous.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Miscellaneous</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Miscellaneous</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc1afed7">1. Introduction</a></li>
<li><a href="#orgde88538">2. Email Configuration</a>
<ul>
<li><a href="#org8022fe0">2.1. Notmuch</a></li>
<li><a href="#org3795dd1">2.2. Email Sending</a></li>
</ul>
</li>
<li><a href="#org43b7e65">3. GPTel - AI Chat Integration</a>
<ul>
<li><a href="#org55ad445">3.1. Core Configuration</a></li>
<li><a href="#org36d157a">3.2. Backend Configuration</a></li>
<li><a href="#org3799641">3.3. Easy Model Switching</a></li>
<li><a href="#org245a5f3">3.4. Automatic Chat History Saving</a></li>
<li><a href="#org1702e8d">3.5. Enhanced Chat Interface</a></li>
<li><a href="#org38cba22">3.6. Usage Guide</a></li>
</ul>
</li>
<li><a href="#org9bf900e">4. PDF Tools</a></li>
<li><a href="#org1d9c40e">5. Utility Functions</a>
<ul>
<li><a href="#org4ae40b1">5.1. Open in External Application</a></li>
<li><a href="#orgef80b3c">5.2. Copy File Path</a></li>
<li><a href="#orgd23c35f">5.3. Reload Configuration</a></li>
<li><a href="#orgb8480cf">5.4. Kill Other Buffers</a></li>
</ul>
</li>
<li><a href="#org4dc9628">6. Database Configuration (Disabled)</a></li>
<li><a href="#orgd500d0b">7. End of File</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1afed7" class="outline-2">
<h2 id="orgc1afed7"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Miscellaneous utilities and configurations including email, AI chat integration, PDF tools, and helper functions.
</p>
</div>
</div>

<div id="outline-container-orgde88538" class="outline-2">
<h2 id="orgde88538"><span class="section-number-2">2.</span> Email Configuration</h2>
<div class="outline-text-2" id="text-2">
<p>
Configuration for reading and sending email using notmuch and msmtp.
</p>
</div>

<div id="outline-container-org8022fe0" class="outline-3">
<h3 id="org8022fe0"><span class="section-number-3">2.1.</span> Notmuch</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Fast email indexing and searching with notmuch.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">misc-conf.el --- Miscellaneous Configuration  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Miscellaneous utilities including email, AI chat, PDF tools, and helpers.
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Email - Notmuch
</span>(<span class="org-keyword">use-package</span> notmuch
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> mail-user-agent 'notmuch-user-agent))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3795dd1" class="outline-3">
<h3 id="org3795dd1"><span class="section-number-3">2.2.</span> Email Sending</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Configure email sending with msmtp and authentication.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Email - Sending Configuration
</span>(<span class="org-keyword">setq</span> user-full-name (<span class="org-keyword">or</span> (getenv <span class="org-string">"USER_FULL_NAME"</span>) user-full-name)
      user-mail-address (<span class="org-keyword">or</span> (getenv <span class="org-string">"USER_EMAIL"</span>) user-mail-address)
      auth-sources '(<span class="org-string">"~/.authinfo.gpg"</span> <span class="org-string">"~/.authinfo"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Use msmtp for sending mail
</span>(<span class="org-keyword">setq</span> send-mail-function 'sendmail-send-it
      message-send-mail-function 'message-send-mail-with-sendmail
      sendmail-program (<span class="org-keyword">or</span> (executable-find <span class="org-string">"msmtp"</span>) <span class="org-string">"/usr/bin/msmtp"</span>)
      message-sendmail-envelope-from 'header)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org43b7e65" class="outline-2">
<h2 id="org43b7e65"><span class="section-number-2">3.</span> GPTel - AI Chat Integration</h2>
<div class="outline-text-2" id="text-3">
<p>
Comprehensive AI chat integration with support for multiple providers (OpenAI, Claude, Gemini, etc.) with easy model switching and automatic chat history saving.
</p>
</div>

<div id="outline-container-org55ad445" class="outline-3">
<h3 id="org55ad445"><span class="section-number-3">3.1.</span> Core Configuration</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">GPTel - AI Chat Integration
</span>(<span class="org-keyword">use-package</span> gptel
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Default mode for chat buffers
</span>  (gptel-default-mode 'org-mode)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Directory for saving chat history
</span>  (gptel-chat-history-directory
   (expand-file-name <span class="org-string">"gptel-history"</span> user-emacs-directory))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Model settings
</span>  (gptel-model <span class="org-string">"claude-opus-4-5-20251101"</span>)
  (gptel-backend nil)  <span class="org-comment-delimiter">; </span><span class="org-comment">Will be set by backend setup
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Streaming responses
</span>  (gptel-stream t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Display settings
</span>  (gptel-use-curl t)
  (gptel-crowdsource-default-mode 'org-mode)

  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Ensure chat history directory exists
</span>  (<span class="org-keyword">let</span> ((history-dir (expand-file-name <span class="org-string">"gptel-history"</span> user-emacs-directory)))
    (<span class="org-keyword">unless</span> (file-directory-p history-dir)
      (make-directory history-dir t))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org36d157a" class="outline-3">
<h3 id="org36d157a"><span class="section-number-3">3.2.</span> Backend Configuration</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Set up multiple AI backends with API keys from environment variables or auth-sources.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">GPTel Backend Configuration
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Helper function to get API key
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-get-api-key</span> (service)
  <span class="org-doc">"Get API key for SERVICE from environment or auth-sources.
SERVICE should be something like '</span><span class="org-doc"><span class="org-constant">OPENAI_API_KEY</span></span><span class="org-doc">' or '</span><span class="org-doc"><span class="org-constant">ANTHROPIC_API_KEY</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">or</span> (getenv service)
      (plist-get (car (auth-source-search <span class="org-builtin">:host</span> service)) <span class="org-builtin">:secret</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Configure backends
</span>(<span class="org-keyword">with-eval-after-load</span> 'gptel
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Anthropic (Claude)
</span>  (<span class="org-keyword">when-let</span> ((key (fu/gptel-get-api-key <span class="org-string">"CLAUDE_API_KEY"</span>)))
    (<span class="org-keyword">setq</span> gptel-anthropic-key key)
    (<span class="org-keyword">unless</span> gptel-backend
      (<span class="org-keyword">setq</span> gptel-backend
            (gptel-make-anthropic <span class="org-string">"Claude"</span>
              <span class="org-builtin">:stream</span> t
              <span class="org-builtin">:key</span> key))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">OpenAI (GPT)
</span>  (<span class="org-keyword">when-let</span> ((key (fu/gptel-get-api-key <span class="org-string">"OPENAI_API_KEY"</span>)))
    (<span class="org-keyword">setq</span> gptel-openai-key key)
    (gptel-make-openai <span class="org-string">"ChatGPT"</span>
      <span class="org-builtin">:stream</span> t
      <span class="org-builtin">:key</span> key
      <span class="org-builtin">:models</span> '(<span class="org-string">"gpt-5.1-2025-11-13"</span>
                <span class="org-string">"gpt-5.1-codex"</span>
                <span class="org-string">"gpt-4.1"</span>
                <span class="org-string">"gpt-4.1-mini"</span>
                <span class="org-string">"gpt-4.1-nano"</span>
                <span class="org-string">"gpt-4o"</span>
                <span class="org-string">"gpt-4o-mini"</span>
                <span class="org-string">"gpt-4-turbo"</span>
                <span class="org-string">"gpt-3.5-turbo"</span>)))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Google (Gemini)
</span>  (<span class="org-keyword">when-let</span> ((key (fu/gptel-get-api-key <span class="org-string">"GEMINI_API_KEY"</span>)))
    (gptel-make-gemini <span class="org-string">"Gemini"</span>
      <span class="org-builtin">:stream</span> t
      <span class="org-builtin">:key</span> key
      <span class="org-builtin">:models</span> '(<span class="org-string">"gemini-3-pro-preview"</span>
                <span class="org-string">"gemini-2.5-pro"</span>
                <span class="org-string">"gemini-2.5-flash"</span>
                <span class="org-string">"gemini-2.5-flash-lite-preview"</span>
                <span class="org-string">"gemini-2.0-flash-exp"</span>
                <span class="org-string">"gemini-1.5-pro"</span>
                <span class="org-string">"gemini-1.5-flash"</span>))))
</pre>
</div>
</div>
</div>
