content/emacs/configs/10-miscellaneous.org
** Easy Model Switching

Convenient functions to switch between different AI models quickly.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;; GPTel Model Switching Functions

  (defvar fu/gptel-models
    '(;; Claude models (newest first)
      ("Claude Opus 4.5" . (anthropic "claude-opus-4-5-20251101"))
      ("Claude Sonnet 4.5" . (anthropic "claude-sonnet-4-5-20250929"))
      ("Claude Opus 4.1" . (anthropic "claude-opus-4-1-20250805"))
      ("Claude Opus 4" . (anthropic "claude-opus-4-20250514"))
      ("Claude Sonnet 4" . (anthropic "claude-sonnet-4-20250514"))
      ("Claude 3.5 Sonnet" . (anthropic "claude-3-5-sonnet-20241022"))
      ("Claude 3 Opus" . (anthropic "claude-3-opus-20240229"))
      ("Claude 3 Haiku" . (anthropic "claude-3-haiku-20240307"))
      ;; OpenAI models (newest first)
      ("GPT-5.1" . (openai "gpt-5.1-2025-11-13"))
      ("GPT-5.1 Codex" . (openai "gpt-5.1-codex"))
      ("GPT-4.1" . (openai "gpt-4.1"))
      ("GPT-4.1 Mini" . (openai "gpt-4.1-mini"))
      ("GPT-4.1 Nano" . (openai "gpt-4.1-nano"))
      ("GPT-4o" . (openai "gpt-4o"))
      ("GPT-4o Mini" . (openai "gpt-4o-mini"))
      ("GPT-4 Turbo" . (openai "gpt-4-turbo"))
      ("GPT-3.5 Turbo" . (openai "gpt-3.5-turbo"))
      ;; Gemini models (newest first)
      ("Gemini 3 Pro" . (gemini "gemini-3-pro-preview"))
      ("Gemini 2.5 Pro" . (gemini "gemini-2.5-pro"))
      ("Gemini 2.5 Flash" . (gemini "gemini-2.5-flash"))
      ("Gemini 2.5 Flash Lite" . (gemini "gemini-2.5-flash-lite-preview"))
      ("Gemini 2.0 Flash" . (gemini "gemini-2.0-flash-exp"))
      ("Gemini 1.5 Pro" . (gemini "gemini-1.5-pro"))
      ("Gemini 1.5 Flash" . (gemini "gemini-1.5-flash")))
    "Alist of model display names to (provider model-id) pairs.")

  (defun fu/gptel-set-model (model-name)
    "Switch GPTel to MODEL-NAME from predefined list."
    (interactive
     (list (completing-read "Select AI model: "
                           (mapcar #'car fu/gptel-models)
                           nil t)))
    (when-let* ((model-info (alist-get model-name fu/gptel-models nil nil #'string=))
                (provider (car model-info))
                (model-id (cadr model-info)))
      (pcase provider
        ('anthropic
         (when-let ((key (fu/gptel-get-api-key "CLAUDE_API_KEY")))
           (setq gptel-backend (gptel-make-anthropic "Claude" :stream t :key key)
                 gptel-model model-id)
           (message "Switched to %s (%s)" model-name model-id)))
        ('openai
         (when-let ((key (fu/gptel-get-api-key "OPENAI_API_KEY")))
           (setq gptel-backend (gptel-make-openai "ChatGPT" :stream t :key key)
                 gptel-model model-id)
           (message "Switched to %s (%s)" model-name model-id)))
        ('gemini
         (when-let ((key (fu/gptel-get-api-key "GOOGLE_API_KEY")))
           (setq gptel-backend (gptel-make-gemini "Gemini" :stream t :key key)
                 gptel-model model-id)
           (message "Switched to %s (%s)" model-name model-id))))))

  ;; Quick switch functions
  (defun fu/gptel-use-claude ()
    "Switch to Claude Opus 4.5 (latest)."
    (interactive)
    (fu/gptel-set-model "Claude Opus 4.5"))

  (defun fu/gptel-use-gpt4 ()
    "Switch to GPT-5.1 (latest)."
    (interactive)
    (fu/gptel-set-model "GPT-5.1"))

  (defun fu/gptel-use-gemini ()
    "Switch to Gemini 3 Pro (latest)."
    (interactive)
    (fu/gptel-set-model "Gemini 3 Pro"))
#+end_src

