emacs/configs/10-miscellaneous.html

<div id="outline-container-org3799641" class="outline-3">
<h3 id="org3799641"><span class="section-number-3">3.3.</span> Easy Model Switching</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Convenient functions to switch between different AI models quickly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">GPTel Model Switching Functions
</span>
(<span class="org-keyword">defvar</span> <span class="org-variable-name">fu/gptel-models</span>
  '(<span class="org-comment-delimiter">;; </span><span class="org-comment">Claude models (newest first)
</span>    (<span class="org-string">"Claude Opus 4.5"</span> . (anthropic <span class="org-string">"claude-opus-4-5-20251101"</span>))
    (<span class="org-string">"Claude Sonnet 4.5"</span> . (anthropic <span class="org-string">"claude-sonnet-4-5-20250929"</span>))
    (<span class="org-string">"Claude Opus 4.1"</span> . (anthropic <span class="org-string">"claude-opus-4-1-20250805"</span>))
    (<span class="org-string">"Claude Opus 4"</span> . (anthropic <span class="org-string">"claude-opus-4-20250514"</span>))
    (<span class="org-string">"Claude Sonnet 4"</span> . (anthropic <span class="org-string">"claude-sonnet-4-20250514"</span>))
    (<span class="org-string">"Claude 3.5 Sonnet"</span> . (anthropic <span class="org-string">"claude-3-5-sonnet-20241022"</span>))
    (<span class="org-string">"Claude 3 Opus"</span> . (anthropic <span class="org-string">"claude-3-opus-20240229"</span>))
    (<span class="org-string">"Claude 3 Haiku"</span> . (anthropic <span class="org-string">"claude-3-haiku-20240307"</span>))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">OpenAI models (newest first)
</span>    (<span class="org-string">"GPT-5.1"</span> . (openai <span class="org-string">"gpt-5.1-2025-11-13"</span>))
    (<span class="org-string">"GPT-5.1 Codex"</span> . (openai <span class="org-string">"gpt-5.1-codex"</span>))
    (<span class="org-string">"GPT-4.1"</span> . (openai <span class="org-string">"gpt-4.1"</span>))
    (<span class="org-string">"GPT-4.1 Mini"</span> . (openai <span class="org-string">"gpt-4.1-mini"</span>))
    (<span class="org-string">"GPT-4.1 Nano"</span> . (openai <span class="org-string">"gpt-4.1-nano"</span>))
    (<span class="org-string">"GPT-4o"</span> . (openai <span class="org-string">"gpt-4o"</span>))
    (<span class="org-string">"GPT-4o Mini"</span> . (openai <span class="org-string">"gpt-4o-mini"</span>))
    (<span class="org-string">"GPT-4 Turbo"</span> . (openai <span class="org-string">"gpt-4-turbo"</span>))
    (<span class="org-string">"GPT-3.5 Turbo"</span> . (openai <span class="org-string">"gpt-3.5-turbo"</span>))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Gemini models (newest first)
</span>    (<span class="org-string">"Gemini 3 Pro"</span> . (gemini <span class="org-string">"gemini-3-pro-preview"</span>))
    (<span class="org-string">"Gemini 2.5 Pro"</span> . (gemini <span class="org-string">"gemini-2.5-pro"</span>))
    (<span class="org-string">"Gemini 2.5 Flash"</span> . (gemini <span class="org-string">"gemini-2.5-flash"</span>))
    (<span class="org-string">"Gemini 2.5 Flash Lite"</span> . (gemini <span class="org-string">"gemini-2.5-flash-lite-preview"</span>))
    (<span class="org-string">"Gemini 2.0 Flash"</span> . (gemini <span class="org-string">"gemini-2.0-flash-exp"</span>))
    (<span class="org-string">"Gemini 1.5 Pro"</span> . (gemini <span class="org-string">"gemini-1.5-pro"</span>))
    (<span class="org-string">"Gemini 1.5 Flash"</span> . (gemini <span class="org-string">"gemini-1.5-flash"</span>)))
  <span class="org-doc">"Alist of model display names to (provider model-id) pairs."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-set-model</span> (model-name)
  <span class="org-doc">"Switch GPTel to MODEL-NAME from predefined list."</span>
  (<span class="org-keyword">interactive</span>
   (list (completing-read <span class="org-string">"Select AI model: "</span>
                         (mapcar #'car fu/gptel-models)
                         nil t)))
  (<span class="org-keyword">when-let*</span> ((model-info (alist-get model-name fu/gptel-models nil nil #'string=))
              (provider (car model-info))
              (model-id (cadr model-info)))
    (<span class="org-keyword">pcase</span> provider
      ('anthropic
       (<span class="org-keyword">when-let</span> ((key (fu/gptel-get-api-key <span class="org-string">"CLAUDE_API_KEY"</span>)))
         (<span class="org-keyword">setq</span> gptel-backend (gptel-make-anthropic <span class="org-string">"Claude"</span> <span class="org-builtin">:stream</span> t <span class="org-builtin">:key</span> key)
               gptel-model model-id)
         (message <span class="org-string">"Switched to %s (%s)"</span> model-name model-id)))
      ('openai
       (<span class="org-keyword">when-let</span> ((key (fu/gptel-get-api-key <span class="org-string">"OPENAI_API_KEY"</span>)))
         (<span class="org-keyword">setq</span> gptel-backend (gptel-make-openai <span class="org-string">"ChatGPT"</span> <span class="org-builtin">:stream</span> t <span class="org-builtin">:key</span> key)
               gptel-model model-id)
         (message <span class="org-string">"Switched to %s (%s)"</span> model-name model-id)))
      ('gemini
       (<span class="org-keyword">when-let</span> ((key (fu/gptel-get-api-key <span class="org-string">"GOOGLE_API_KEY"</span>)))
         (<span class="org-keyword">setq</span> gptel-backend (gptel-make-gemini <span class="org-string">"Gemini"</span> <span class="org-builtin">:stream</span> t <span class="org-builtin">:key</span> key)
               gptel-model model-id)
         (message <span class="org-string">"Switched to %s (%s)"</span> model-name model-id))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Quick switch functions
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-use-claude</span> ()
  <span class="org-doc">"Switch to Claude Opus 4.5 (latest)."</span>
  (<span class="org-keyword">interactive</span>)
  (fu/gptel-set-model <span class="org-string">"Claude Opus 4.5"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-use-gpt4</span> ()
  <span class="org-doc">"Switch to GPT-5.1 (latest)."</span>
  (<span class="org-keyword">interactive</span>)
  (fu/gptel-set-model <span class="org-string">"GPT-5.1"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-use-gemini</span> ()
  <span class="org-doc">"Switch to Gemini 3 Pro (latest)."</span>
  (<span class="org-keyword">interactive</span>)
  (fu/gptel-set-model <span class="org-string">"Gemini 3 Pro"</span>))
</pre>
</div>
</div>
</div>
