content/emacs/configs/10-miscellaneous.org
** Automatic Chat History Saving

Automatically save chat conversations to disk with timestamps and model information.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;; GPTel Chat History Management

  (defun fu/gptel-save-chat ()
    "Save current gptel chat buffer to history directory."
    (interactive)
    (when (and (derived-mode-p 'org-mode)
               (bound-and-true-p gptel-mode))
      (let* ((timestamp (format-time-string "%Y%m%d-%H%M%S"))
             (model-name (replace-regexp-in-string "[^a-zA-Z0-9-]" "-" gptel-model))
             (filename (format "%s-%s.org" timestamp model-name))
             (filepath (expand-file-name filename gptel-chat-history-directory)))
        (write-region (point-min) (point-max) filepath)
        (message "Chat saved to: %s" filepath)
        filepath)))

  (defun fu/gptel-auto-save-chat ()
    "Automatically save chat if it has content."
    (when (and (derived-mode-p 'org-mode)
               (bound-and-true-p gptel-mode)
               (> (buffer-size) 100))  ; Only save if buffer has content
      (fu/gptel-save-chat)))

  ;; Auto-save chat on buffer kill
  (add-hook 'kill-buffer-hook #'fu/gptel-auto-save-chat)

  ;; Periodic auto-save (every 5 minutes)
  (defvar fu/gptel-auto-save-timer nil
    "Timer for auto-saving gptel chats.")

  (defun fu/gptel-enable-auto-save ()
    "Enable periodic auto-saving of gptel chats."
    (interactive)
    (when fu/gptel-auto-save-timer
      (cancel-timer fu/gptel-auto-save-timer))
    (setq fu/gptel-auto-save-timer
          (run-with-idle-timer 300 t
                              (lambda ()
                                (dolist (buf (buffer-list))
                                  (with-current-buffer buf
                                    (fu/gptel-auto-save-chat))))))
    (message "GPTel auto-save enabled (every 5 minutes when idle)"))

  (defun fu/gptel-disable-auto-save ()
    "Disable periodic auto-saving of gptel chats."
    (interactive)
    (when fu/gptel-auto-save-timer
      (cancel-timer fu/gptel-auto-save-timer)
      (setq fu/gptel-auto-save-timer nil)
      (message "GPTel auto-save disabled")))

  ;; Load a saved chat
  (defun fu/gptel-load-chat ()
    "Load a previously saved chat from history."
    (interactive)
    (let* ((files (directory-files gptel-chat-history-directory nil "\\.org$"))
           (file (completing-read "Load chat: " (nreverse files) nil t)))
      (when file
        (find-file (expand-file-name file gptel-chat-history-directory))
        (gptel-mode 1))))
#+end_src

** Enhanced Chat Interface

Improved chat interface with better defaults and keybindings.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;; GPTel Enhanced Interface

  (defun fu/gptel-new-chat ()
    "Start a new gptel chat with current model information in header."
    (interactive)
    (let* ((model-info (format "Model: %s" gptel-model))
           (timestamp (format-time-string "%Y-%m-%d %H:%M"))
           (buf-name (format "*gptel-%s*" timestamp)))
      (with-current-buffer (get-buffer-create buf-name)
        (org-mode)
        (gptel-mode 1)
        (insert (format "#+TITLE: AI Chat - %s\n" timestamp))
        (insert (format "#+DATE: %s\n" timestamp))
        (insert (format "#+MODEL: %s\n" gptel-model))
        (insert (format "#+BACKEND: %s\n\n" (gptel-backend-name gptel-backend)))
        (insert "* Chat\n\n")
        (goto-char (point-max)))
      (switch-to-buffer buf-name)))

  ;; Keybindings for gptel
  (with-eval-after-load 'gptel
    (define-key gptel-mode-map (kbd "C-c g s") #'fu/gptel-save-chat)
    (define-key gptel-mode-map (kbd "C-c g m") #'fu/gptel-set-model)
    (define-key gptel-mode-map (kbd "C-c g n") #'fu/gptel-new-chat)
    (define-key gptel-mode-map (kbd "C-c g l") #'fu/gptel-load-chat))

  ;; Global keybindings
  (global-set-key (kbd "C-c a n") #'fu/gptel-new-chat)
  (global-set-key (kbd "C-c a m") #'fu/gptel-set-model)
  (global-set-key (kbd "C-c a l") #'fu/gptel-load-chat)
  (global-set-key (kbd "C-c a c") #'fu/gptel-use-claude)
  (global-set-key (kbd "C-c a g") #'fu/gptel-use-gpt4)
  (global-set-key (kbd "C-c a G") #'fu/gptel-use-gemini)

  ;; Enable auto-save by default
  (with-eval-after-load 'gptel
    (fu/gptel-enable-auto-save))
#+end_src

** Usage Guide

Quick reference for using gptel:

*** Starting a Chat
- =C-c a n= : Start new chat with current model
- =M-x gptel= : Start chat in current buffer

*** Model Switching
- =C-c a m= : Choose from all available models
- =C-c a c= : Quick switch to Claude Opus 4.5 (latest)
- =C-c a g= : Quick switch to GPT-5.1 (latest)
- =C-c a G= : Quick switch to Gemini 3 Pro (latest)

*** Chat Management
- =C-c g s= : Manually save current chat (in gptel buffer)
- =C-c a l= : Load a saved chat from history
- Auto-save: Chats automatically save every 5 minutes when idle
- Auto-save on buffer kill: Chats save when you close the buffer

*** In Chat Buffer
- =C-c RET= : Send message
- =C-c g m= : Switch model mid-conversation
- =C-c g n= : Start new chat

*** Configuration
API keys should be set as environment variables:
- =CLAUDE_API_KEY= : For Claude models (Anthropic)
- =OPENAI_API_KEY= : For GPT models (OpenAI)
- =GOOGLE_API_KEY= : For Gemini models (Google)

Or stored in =~/.authinfo.gpg= with host entries matching the key names.

Chat history location: =~/.emacs.d/gptel-history/= (customizable via =gptel-chat-history-directory=)

