emacs/configs/10-miscellaneous.html

<div id="outline-container-org245a5f3" class="outline-3">
<h3 id="org245a5f3"><span class="section-number-3">3.4.</span> Automatic Chat History Saving</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Automatically save chat conversations to disk with timestamps and model information.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">GPTel Chat History Management
</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-save-chat</span> ()
  <span class="org-doc">"Save current gptel chat buffer to history directory."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (derived-mode-p 'org-mode)
             (<span class="org-keyword">bound-and-true-p</span> gptel-mode))
    (<span class="org-keyword">let*</span> ((timestamp (format-time-string <span class="org-string">"%Y%m%d-%H%M%S"</span>))
           (model-name (replace-regexp-in-string <span class="org-string">"[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">a-zA-Z0-9-]"</span> <span class="org-string">"-"</span> gptel-model))
           (filename (format <span class="org-string">"%s-%s.org"</span> timestamp model-name))
           (filepath (expand-file-name filename gptel-chat-history-directory)))
      (write-region (point-min) (point-max) filepath)
      (message <span class="org-string">"Chat saved to: %s"</span> filepath)
      filepath)))

(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-auto-save-chat</span> ()
  <span class="org-doc">"Automatically save chat if it has content."</span>
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (derived-mode-p 'org-mode)
             (<span class="org-keyword">bound-and-true-p</span> gptel-mode)
             (&gt; (buffer-size) 100))  <span class="org-comment-delimiter">; </span><span class="org-comment">Only save if buffer has content
</span>    (fu/gptel-save-chat)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-save chat on buffer kill
</span>(add-hook 'kill-buffer-hook #'fu/gptel-auto-save-chat)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Periodic auto-save (every 5 minutes)
</span>(<span class="org-keyword">defvar</span> <span class="org-variable-name">fu/gptel-auto-save-timer</span> nil
  <span class="org-doc">"Timer for auto-saving gptel chats."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-enable-auto-save</span> ()
  <span class="org-doc">"Enable periodic auto-saving of gptel chats."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> fu/gptel-auto-save-timer
    (cancel-timer fu/gptel-auto-save-timer))
  (<span class="org-keyword">setq</span> fu/gptel-auto-save-timer
        (run-with-idle-timer 300 t
                            (<span class="org-keyword">lambda</span> ()
                              (<span class="org-keyword">dolist</span> (buf (buffer-list))
                                (<span class="org-keyword">with-current-buffer</span> buf
                                  (fu/gptel-auto-save-chat))))))
  (message <span class="org-string">"GPTel auto-save enabled (every 5 minutes when idle)"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-disable-auto-save</span> ()
  <span class="org-doc">"Disable periodic auto-saving of gptel chats."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> fu/gptel-auto-save-timer
    (cancel-timer fu/gptel-auto-save-timer)
    (<span class="org-keyword">setq</span> fu/gptel-auto-save-timer nil)
    (message <span class="org-string">"GPTel auto-save disabled"</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Load a saved chat
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-load-chat</span> ()
  <span class="org-doc">"Load a previously saved chat from history."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((files (directory-files gptel-chat-history-directory nil <span class="org-string">"\\.org$"</span>))
         (file (completing-read <span class="org-string">"Load chat: "</span> (nreverse files) nil t)))
    (<span class="org-keyword">when</span> file
      (find-file (expand-file-name file gptel-chat-history-directory))
      (gptel-mode 1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1702e8d" class="outline-3">
<h3 id="org1702e8d"><span class="section-number-3">3.5.</span> Enhanced Chat Interface</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Improved chat interface with better defaults and keybindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">GPTel Enhanced Interface
</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">fu/gptel-new-chat</span> ()
  <span class="org-doc">"Start a new gptel chat with current model information in header."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((model-info (format <span class="org-string">"Model: %s"</span> gptel-model))
         (timestamp (format-time-string <span class="org-string">"%Y-%m-%d %H:%M"</span>))
         (buf-name (format <span class="org-string">"*gptel-%s*"</span> timestamp)))
    (<span class="org-keyword">with-current-buffer</span> (get-buffer-create buf-name)
      (org-mode)
      (gptel-mode 1)
      (insert (format <span class="org-string">"#+TITLE: AI Chat - %s\n"</span> timestamp))
      (insert (format <span class="org-string">"#+DATE: %s\n"</span> timestamp))
      (insert (format <span class="org-string">"#+MODEL: %s\n"</span> gptel-model))
      (insert (format <span class="org-string">"#+BACKEND: %s\n\n"</span> (gptel-backend-name gptel-backend)))
      (insert <span class="org-string">"* Chat\n\n"</span>)
      (goto-char (point-max)))
    (switch-to-buffer buf-name)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Keybindings for gptel
</span>(<span class="org-keyword">with-eval-after-load</span> 'gptel
  (define-key gptel-mode-map (kbd <span class="org-string">"C-c g s"</span>) #'fu/gptel-save-chat)
  (define-key gptel-mode-map (kbd <span class="org-string">"C-c g m"</span>) #'fu/gptel-set-model)
  (define-key gptel-mode-map (kbd <span class="org-string">"C-c g n"</span>) #'fu/gptel-new-chat)
  (define-key gptel-mode-map (kbd <span class="org-string">"C-c g l"</span>) #'fu/gptel-load-chat))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Global keybindings
</span>(global-set-key (kbd <span class="org-string">"C-c a n"</span>) #'fu/gptel-new-chat)
(global-set-key (kbd <span class="org-string">"C-c a m"</span>) #'fu/gptel-set-model)
(global-set-key (kbd <span class="org-string">"C-c a l"</span>) #'fu/gptel-load-chat)
(global-set-key (kbd <span class="org-string">"C-c a c"</span>) #'fu/gptel-use-claude)
(global-set-key (kbd <span class="org-string">"C-c a g"</span>) #'fu/gptel-use-gpt4)
(global-set-key (kbd <span class="org-string">"C-c a G"</span>) #'fu/gptel-use-gemini)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Enable auto-save by default
</span>(<span class="org-keyword">with-eval-after-load</span> 'gptel
  (fu/gptel-enable-auto-save))
</pre>
</div>
</div>
</div>

<div id="outline-container-org38cba22" class="outline-3">
<h3 id="org38cba22"><span class="section-number-3">3.6.</span> Usage Guide</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Quick reference for using gptel:
</p>
</div>

<div id="outline-container-orgadc1307" class="outline-4">
<h4 id="orgadc1307"><span class="section-number-4">3.6.1.</span> Starting a Chat</h4>
<div class="outline-text-4" id="text-3-6-1">
<ul class="org-ul">
<li><code>C-c a n</code> : Start new chat with current model</li>
<li><code>M-x gptel</code> : Start chat in current buffer</li>
</ul>
</div>
</div>

<div id="outline-container-org43d038a" class="outline-4">
<h4 id="org43d038a"><span class="section-number-4">3.6.2.</span> Model Switching</h4>
<div class="outline-text-4" id="text-3-6-2">
<ul class="org-ul">
<li><code>C-c a m</code> : Choose from all available models</li>
<li><code>C-c a c</code> : Quick switch to Claude Opus 4.5 (latest)</li>
<li><code>C-c a g</code> : Quick switch to GPT-5.1 (latest)</li>
<li><code>C-c a G</code> : Quick switch to Gemini 3 Pro (latest)</li>
</ul>
</div>
</div>

<div id="outline-container-org6e8e21b" class="outline-4">
<h4 id="org6e8e21b"><span class="section-number-4">3.6.3.</span> Chat Management</h4>
<div class="outline-text-4" id="text-3-6-3">
<ul class="org-ul">
<li><code>C-c g s</code> : Manually save current chat (in gptel buffer)</li>
<li><code>C-c a l</code> : Load a saved chat from history</li>
<li>Auto-save: Chats automatically save every 5 minutes when idle</li>
<li>Auto-save on buffer kill: Chats save when you close the buffer</li>
</ul>
</div>
</div>

<div id="outline-container-orgd744293" class="outline-4">
<h4 id="orgd744293"><span class="section-number-4">3.6.4.</span> In Chat Buffer</h4>
<div class="outline-text-4" id="text-3-6-4">
<ul class="org-ul">
<li><code>C-c RET</code> : Send message</li>
<li><code>C-c g m</code> : Switch model mid-conversation</li>
<li><code>C-c g n</code> : Start new chat</li>
</ul>
</div>
</div>

<div id="outline-container-orgdbb9b53" class="outline-4">
<h4 id="orgdbb9b53"><span class="section-number-4">3.6.5.</span> Configuration</h4>
<div class="outline-text-4" id="text-3-6-5">
<p>
API keys should be set as environment variables:
</p>
<ul class="org-ul">
<li><code>CLAUDE_API_KEY</code> : For Claude models (Anthropic)</li>
<li><code>OPENAI_API_KEY</code> : For GPT models (OpenAI)</li>
<li><code>GOOGLE_API_KEY</code> : For Gemini models (Google)</li>
</ul>

<p>
Or stored in <code>~/.authinfo.gpg</code> with host entries matching the key names.
</p>

<p>
Chat history location: <code>~/.emacs.d/gptel-history/</code> (customizable via <code>gptel-chat-history-directory</code>)
</p>
</div>
</div>
</div>
</div>
