content/emacs/configs/10-miscellaneous.org
* PDF Tools

PDF viewing and annotation in Emacs with pdf-tools. Currently disabled - uncomment to enable.

Reference: [[https://emacselements.com/pdf-tools-settings.html][EmacsElements PDF Tools Settings]]

Features:
- Native PDF rendering
- Annotation support
- Fast navigation
- Text search
- Bookmarks and outline navigation

#+begin_src emacs-lisp :tangle no
  ;; PDF Tools
  (use-package pdf-tools
    :ensure t
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :config
    (pdf-tools-install :no-query)

    ;; Keybindings
    (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
    (define-key pdf-view-mode-map (kbd "C-r") 'isearch-backward)

    ;; Auto-revert
    (add-hook 'pdf-view-mode-hook #'auto-revert-mode)

    ;; Midnight mode for dark theme support
    (add-hook 'pdf-view-mode-hook #'pdf-view-midnight-minor-mode))

  ;; Save place in PDF files
  (use-package saveplace-pdf-view
    :ensure t
    :after pdf-tools)
#+end_src

* Utility Functions

General utility functions for improved Emacs workflow.

** Open in External Application

Open current file or URL in external application.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  ;; Utility Functions

  (defun fu/open-in-external-app ()
    "Open current file or URL in external application."
    (interactive)
    (let ((path (or (buffer-file-name)
                   (when (eq major-mode 'dired-mode)
                     (dired-get-file-for-visit)))))
      (if path
          (cond
           ((eq system-type 'darwin)
            (call-process "open" nil 0 nil path))
           ((eq system-type 'gnu/linux)
            (call-process "xdg-open" nil 0 nil path))
           ((eq system-type 'windows-nt)
            (w32-shell-execute "open" path)))
        (message "No file or URL to open"))))

  (global-set-key (kbd "C-c o") #'fu/open-in-external-app)
#+end_src

** Copy File Path

Copy current file path to clipboard.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  (defun fu/copy-file-path ()
    "Copy the current buffer file path to clipboard."
    (interactive)
    (when-let ((path (or (buffer-file-name)
                        default-directory)))
      (kill-new path)
      (message "Copied: %s" path)))

  (global-set-key (kbd "C-c y p") #'fu/copy-file-path)
#+end_src

** Reload Configuration

Quickly reload Emacs configuration.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  (defun fu/reload-config ()
    "Reload Emacs configuration."
    (interactive)
    (load-file user-init-file)
    (message "Configuration reloaded!"))

  (global-set-key (kbd "C-c r c") #'fu/reload-config)
#+end_src

** Kill Other Buffers

Kill all buffers except the current one.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  (defun fu/kill-other-buffers ()
    "Kill all buffers except the current one."
    (interactive)
    (let ((current-buf (current-buffer)))
      (dolist (buf (buffer-list))
        (unless (or (eq buf current-buf)
                   (string-prefix-p " " (buffer-name buf)))
          (kill-buffer buf))))
    (message "Killed all other buffers"))

  (global-set-key (kbd "C-c k o") #'fu/kill-other-buffers)
#+end_src

* Database Configuration (Disabled)

Example database configuration with ejc-sql. Disabled by default.

#+begin_src emacs-lisp :tangle no
  ;; Database Configuration - ejc-sql
  (use-package ejc-sql
    :ensure t
    :defer t
    :custom
    (clomacs-httpd-default-port 8888)
    :config
    (let ((ojdbc-path "~/.m2/repository/com/oracle/ojdbc8/8/ojdbc8-8.jar")
          (maria-path "~/.m2/repository/org/mariadb/jdbc/mariadb-java-client/2.6.2/mariadb-java-client-2.6.2.jar"))
      ;; Oracle connection example
      (ejc-create-connection
       "Oracle DB"
       :classpath      ojdbc-path
       :connection-uri (concat "jdbc:oracle:thin:@"
                              (getenv "DB_HOST") ":"
                              (getenv "DB_PORT") ":"
                              (getenv "DB_NAME"))
       :user           (getenv "DB_USERNAME")
       :password       (getenv "DB_PASSWORD")
       :separator      "/")

      ;; MariaDB connection example
      (ejc-create-connection
       "MariaDB"
       :classpath      maria-path
       :connection-uri "jdbc:mariadb://host:port/dbname"
       :user           "username"
       :password       "password"
       :separator      "/")))
#+end_src

* End of File

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/misc-conf.el
  (provide 'misc-conf)
  ;;; misc-conf.el ends here
#+end_src
