emacs/configs/10-miscellaneous.html

<div id="outline-container-org9bf900e" class="outline-2">
<h2 id="org9bf900e"><span class="section-number-2">4.</span> PDF Tools</h2>
<div class="outline-text-2" id="text-4">
<p>
PDF viewing and annotation in Emacs with pdf-tools. Currently disabled - uncomment to enable.
</p>

<p>
Reference: <a href="https://emacselements.com/pdf-tools-settings.html">EmacsElements PDF Tools Settings</a>
</p>

<p>
Features:
</p>
<ul class="org-ul">
<li>Native PDF rendering</li>
<li>Annotation support</li>
<li>Fast navigation</li>
<li>Text search</li>
<li>Bookmarks and outline navigation</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">PDF Tools
</span>(<span class="org-keyword">use-package</span> pdf-tools
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.pdf\\'"</span> . pdf-view-mode)
  <span class="org-builtin">:config</span>
  (pdf-tools-install <span class="org-builtin">:no-query</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Keybindings
</span>  (define-key pdf-view-mode-map (kbd <span class="org-string">"C-s"</span>) 'isearch-forward)
  (define-key pdf-view-mode-map (kbd <span class="org-string">"C-r"</span>) 'isearch-backward)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-revert
</span>  (add-hook 'pdf-view-mode-hook #'auto-revert-mode)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Midnight mode for dark theme support
</span>  (add-hook 'pdf-view-mode-hook #'pdf-view-midnight-minor-mode))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Save place in PDF files
</span>(<span class="org-keyword">use-package</span> saveplace-pdf-view
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> pdf-tools)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d9c40e" class="outline-2">
<h2 id="org1d9c40e"><span class="section-number-2">5.</span> Utility Functions</h2>
<div class="outline-text-2" id="text-5">
<p>
General utility functions for improved Emacs workflow.
</p>
</div>

<div id="outline-container-org4ae40b1" class="outline-3">
<h3 id="org4ae40b1"><span class="section-number-3">5.1.</span> Open in External Application</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Open current file or URL in external application.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Utility Functions
</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">fu/open-in-external-app</span> ()
  <span class="org-doc">"Open current file or URL in external application."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((path (<span class="org-keyword">or</span> (buffer-file-name)
                 (<span class="org-keyword">when</span> (eq major-mode 'dired-mode)
                   (dired-get-file-for-visit)))))
    (<span class="org-keyword">if</span> path
        (<span class="org-keyword">cond</span>
         ((eq system-type 'darwin)
          (call-process <span class="org-string">"open"</span> nil 0 nil path))
         ((eq system-type 'gnu/linux)
          (call-process <span class="org-string">"xdg-open"</span> nil 0 nil path))
         ((eq system-type 'windows-nt)
          (w32-shell-execute <span class="org-string">"open"</span> path)))
      (message <span class="org-string">"No file or URL to open"</span>))))

(global-set-key (kbd <span class="org-string">"C-c o"</span>) #'fu/open-in-external-app)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef80b3c" class="outline-3">
<h3 id="orgef80b3c"><span class="section-number-3">5.2.</span> Copy File Path</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Copy current file path to clipboard.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">fu/copy-file-path</span> ()
  <span class="org-doc">"Copy the current buffer file path to clipboard."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when-let</span> ((path (<span class="org-keyword">or</span> (buffer-file-name)
                      default-directory)))
    (kill-new path)
    (message <span class="org-string">"Copied: %s"</span> path)))

(global-set-key (kbd <span class="org-string">"C-c y p"</span>) #'fu/copy-file-path)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd23c35f" class="outline-3">
<h3 id="orgd23c35f"><span class="section-number-3">5.3.</span> Reload Configuration</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Quickly reload Emacs configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">fu/reload-config</span> ()
  <span class="org-doc">"Reload Emacs configuration."</span>
  (<span class="org-keyword">interactive</span>)
  (load-file user-init-file)
  (message <span class="org-string">"Configuration reloaded!"</span>))

(global-set-key (kbd <span class="org-string">"C-c r c"</span>) #'fu/reload-config)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8480cf" class="outline-3">
<h3 id="orgb8480cf"><span class="section-number-3">5.4.</span> Kill Other Buffers</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Kill all buffers except the current one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">fu/kill-other-buffers</span> ()
  <span class="org-doc">"Kill all buffers except the current one."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((current-buf (current-buffer)))
    (<span class="org-keyword">dolist</span> (buf (buffer-list))
      (<span class="org-keyword">unless</span> (<span class="org-keyword">or</span> (eq buf current-buf)
                 (string-prefix-p <span class="org-string">" "</span> (buffer-name buf)))
        (kill-buffer buf))))
  (message <span class="org-string">"Killed all other buffers"</span>))

(global-set-key (kbd <span class="org-string">"C-c k o"</span>) #'fu/kill-other-buffers)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4dc9628" class="outline-2">
<h2 id="org4dc9628"><span class="section-number-2">6.</span> Database Configuration (Disabled)</h2>
<div class="outline-text-2" id="text-6">
<p>
Example database configuration with ejc-sql. Disabled by default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Database Configuration - ejc-sql
</span>(<span class="org-keyword">use-package</span> ejc-sql
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:custom</span>
  (clomacs-httpd-default-port 8888)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">let</span> ((ojdbc-path <span class="org-string">"~/.m2/repository/com/oracle/ojdbc8/8/ojdbc8-8.jar"</span>)
        (maria-path <span class="org-string">"~/.m2/repository/org/mariadb/jdbc/mariadb-java-client/2.6.2/mariadb-java-client-2.6.2.jar"</span>))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Oracle connection example
</span>    (ejc-create-connection
     <span class="org-string">"Oracle DB"</span>
     <span class="org-builtin">:classpath</span>      ojdbc-path
     <span class="org-builtin">:connection-uri</span> (concat <span class="org-string">"jdbc:oracle:thin:@"</span>
                            (getenv <span class="org-string">"DB_HOST"</span>) <span class="org-string">":"</span>
                            (getenv <span class="org-string">"DB_PORT"</span>) <span class="org-string">":"</span>
                            (getenv <span class="org-string">"DB_NAME"</span>))
     <span class="org-builtin">:user</span>           (getenv <span class="org-string">"DB_USERNAME"</span>)
     <span class="org-builtin">:password</span>       (getenv <span class="org-string">"DB_PASSWORD"</span>)
     <span class="org-builtin">:separator</span>      <span class="org-string">"/"</span>)

    <span class="org-comment-delimiter">;; </span><span class="org-comment">MariaDB connection example
</span>    (ejc-create-connection
     <span class="org-string">"MariaDB"</span>
     <span class="org-builtin">:classpath</span>      maria-path
     <span class="org-builtin">:connection-uri</span> <span class="org-string">"jdbc:mariadb://host:port/dbname"</span>
     <span class="org-builtin">:user</span>           <span class="org-string">"username"</span>
     <span class="org-builtin">:password</span>       <span class="org-string">"password"</span>
     <span class="org-builtin">:separator</span>      <span class="org-string">"/"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd500d0b" class="outline-2">
<h2 id="orgd500d0b"><span class="section-number-2">7.</span> End of File</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">misc-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">misc-conf.el ends here</span>
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
